{"query": "vitamin C cures COVID-19", "results": {"0": {"docid": "6594", "content": "False claim: Vitamin C cures the new | Vitamin C cures the new coronavirus By Reuters Staff 5 Min Read Posts on social media claim that Vitamin C alone is an effective cure or treatment of COVID-19, the illness caused by the new coronavirus. Examples – including some referring to the recovery of an elderly lady in China, and others promoting fruits such as oranges that are high in Vitamin C - can be seen here , here , here , and here . Vitamin C, according to the National Institutes of Health (NIH) “plays an important role in immune function” ( here ). However, it is false to suggest that Vitamin C is a widely approved treatment or cure for COVID-19. According to the U.S. Centers for Disease Control and Prevention (CDC), “No specific treatment is currently FDA (U.S. Food and Drug Administration) approved” ( here ). A World Health Organization (WHO) document prescribes several methods for trained healthcare professionals to use in managing severe cases of ( bit.ly/2VxMu9B ). These include oxygen therapy and monitoring, the treatment of co-infections with empiric antimicrobials, endotracheal intubation in cases of acute respiratory distress syndrome, and resuscitation from septic shock using crystalloid fluid. As of mid-April, the guide does not mention use of Vitamin C", "url": "https://www.reuters.com/article/uk-factcheck-coronavirus-vitaminc/false-claim-vitamin-c-cures-the-new-coronavirus-idUSKCN21X2PV", "source": "reuters.com", "domain": "reuters.com", "site_name": "U.S.", "title": "False claim: Vitamin C cures the new coronavirus", "content_inference": [0.092, 0.69, 0.22], "sents": {"0": {"sent_id": 4, "sent": "However, it is false to suggest that Vitamin C is a widely approved treatment or cure for COVID-19.", "sent_context": "Vitamin C, according to the National Institutes of Health (NIH) “plays an important role in immune function” ( here ). However, it is false to suggest that Vitamin C is a widely approved treatment or cure for COVID-19. According to the U.S. Centers for Disease Control and Prevention (CDC), “No specific treatment is currently FDA (U.S. Food and Drug Administration) approved” ( here ).", "sent_similarity": 0.806, "sent_inference": [0.014, 0.99, 0.00092]}, "1": {"sent_id": 1, "sent": "the new | Vitamin C cures the new coronavirus By Reuters Staff 5 Min Read Posts on social media claim that Vitamin C alone is an effective cure or treatment of COVID-19, the illness caused by the new coronavirus.", "sent_context": "False claim: Vitamin C cures the new | Vitamin C cures the new coronavirus By Reuters Staff 5 Min Read Posts on social media claim that Vitamin C alone is an effective cure or treatment of COVID-19, the illness caused by the new coronavirus. Examples – including some referring to the recovery of an elderly lady in China, and others promoting fruits such as oranges that are high in Vitamin C - can be seen here , here , here , and here .", "sent_similarity": 0.717, "sent_inference": [0.0088, 0.88, 0.11]}, "2": {"sent_id": 0, "sent": "False claim: Vitamin C cures", "sent_context": "False claim: Vitamin C cures the new | Vitamin C cures the new coronavirus By Reuters Staff 5 Min Read Posts on social media claim that Vitamin C alone is an effective cure or treatment of COVID-19, the illness caused by the new coronavirus.", "sent_similarity": 0.698, "sent_inference": [0.092, 0.69, 0.22]}}}, "1": {"docid": "8955", "content": "Patients were recruited for a clinical trial in Wuhan, China, into the use of vitamin C for COVID-19 in February , however it didn’t reach its planned sample size as the city’s outbreak was brought under control and the number of qualifying patients available decreased. Researchers released a non-peer-reviewed preprint study in August after 27 critically ill COVID-19 patients were given 24g of IV vitamin C daily for a week. The study found the treatment “may provide a protective clinical effect without any adverse events in critically ill patients with COVID-19”. At least three other trials are underway – in Canada , the US and Italy – but their results are yet to be published. Meanwhile, in its series of COVID-19 “mythbusters”, the World Health Organisation notes vitamin C’s critical role in the immune system but adds there is no current guidance on its use as a treatment for the virus. The NIH’s COVID-19 treatment guidelines say the use of high-dose vitamin C in COVID-19 patients is being studied, but there is insufficient evidence on its effectiveness. They note there is “no compelling reason” for the use of vitamin C in non-critically ill patients as they were less likely to be experiencing severe inflammation. In Australia, the Commission on Safety and Quality in Health Care released a position statement in May on the use of high-dose IV vitamin C for COVID-19", "url": "https://www.aap.com.au/a-step-above-injecting-bleach-vitamin-c-cure-for-covid-19-panned/", "source": "aap.com.au", "domain": "aap.com.au", "site_name": "Australian Associated Press", "title": "'A step above injecting bleach': Vitamin C cure for COVID-19 panned - Australian Associated Press", "content_inference": [0.71, 0.29, 0.0029], "sents": {"0": {"sent_id": 7, "sent": "In Australia, the Commission on Safety and Quality in Health Care released a position statement in May on the use of high-dose IV vitamin C for COVID-19", "sent_context": "They note there is “no compelling reason” for the use of vitamin C in non-critically ill patients as they were less likely to be experiencing severe inflammation. In Australia, the Commission on Safety and Quality in Health Care released a position statement in May on the use of high-dose IV vitamin C for COVID-19", "sent_similarity": 0.714, "sent_inference": [0.0025, 1.0, 0.0014]}, "1": {"sent_id": 5, "sent": "The NIH’s COVID-19 treatment guidelines say the use of high-dose vitamin C in COVID-19 patients is being studied, but there is insufficient evidence on its effectiveness.", "sent_context": "Meanwhile, in its series of COVID-19 “mythbusters”, the World Health Organisation notes vitamin C’s critical role in the immune system but adds there is no current guidance on its use as a treatment for the virus. The NIH’s COVID-19 treatment guidelines say the use of high-dose vitamin C in COVID-19 patients is being studied, but there is insufficient evidence on its effectiveness. They note there is “no compelling reason” for the use of vitamin C in non-critically ill patients as they were less likely to be experiencing severe inflammation.", "sent_similarity": 0.712, "sent_inference": [0.71, 0.29, 0.0029]}, "2": {"sent_id": 4, "sent": "Meanwhile, in its series of COVID-19 “mythbusters”, the World Health Organisation notes vitamin C’s critical role in the immune system but adds there is no current guidance on its use as a treatment for the virus.", "sent_context": "At least three other trials are underway – in Canada , the US and Italy – but their results are yet to be published. Meanwhile, in its series of COVID-19 “mythbusters”, the World Health Organisation notes vitamin C’s critical role in the immune system but adds there is no current guidance on its use as a treatment for the virus. The NIH’s COVID-19 treatment guidelines say the use of high-dose vitamin C in COVID-19 patients is being studied, but there is insufficient evidence on its effectiveness.", "sent_similarity": 0.701, "sent_inference": [0.084, 0.91, 0.0017]}}}, "2": {"docid": "8955", "content": "A review of treatments for COVID-19 by Harvard Medical School pointed to earlier studies showing high doses of IV vitamin C may help treat sepsis and acute respiratory distress syndrome (ARDS), which were were “the most common conditions leading to intensive care unit admission, ventilator support, or death among those with severe COVID-19 infections”. But it added “there is no evidence that taking vitamin C will help prevent infection” and high doses of vitamin C could cause nausea, cramps and an increased risk of kidney stones. A study published in PharmaNutrition in April looked at the potential for using high doses of IV vitamin C for treating ARDS in COVID-19 patients. It said vitamin C had shown benefits in reducing symptoms and mortality in some conditions (page 2) and “additional studies detailing the use of IV Vit-C for the treatment of severe Covid-19 infected pneumonia are definitely warranted” (page 6). A non-peer-reviewed overview of the effectiveness of treating COVID-19 with vitamin C by researchers from the University Hospital of Zurich was published in April. It found there was no scientific evidence that either oral or intravenous vitamin C was beneficial in treating the virus. Another review, published in the Journal of Global Antimicrobial Resistance in October , found high doses of vitamin C may “favourably impact patients with viral pneumonia and ARDS in severe SAR-CoV-2 infected patients”", "url": "https://www.aap.com.au/a-step-above-injecting-bleach-vitamin-c-cure-for-covid-19-panned/", "source": "aap.com.au", "domain": "aap.com.au", "site_name": "Australian Associated Press", "title": "'A step above injecting bleach': Vitamin C cure for COVID-19 panned - Australian Associated Press", "content_inference": [0.034, 0.96, 0.0071], "sents": {"0": {"sent_id": 4, "sent": "A non-peer-reviewed overview of the effectiveness of treating COVID-19 with vitamin C by researchers from the University Hospital of Zurich was published in April.", "sent_context": "It said vitamin C had shown benefits in reducing symptoms and mortality in some conditions (page 2) and “additional studies detailing the use of IV Vit-C for the treatment of severe Covid-19 infected pneumonia are definitely warranted” (page 6). A non-peer-reviewed overview of the effectiveness of treating COVID-19 with vitamin C by researchers from the University Hospital of Zurich was published in April. It found there was no scientific evidence that either oral or intravenous vitamin C was beneficial in treating the virus.", "sent_similarity": 0.752, "sent_inference": [0.0015, 1.0, 0.00096]}, "1": {"sent_id": 0, "sent": "A review of treatments for COVID-19 by Harvard Medical School pointed to earlier studies showing high doses of IV vitamin C may help treat sepsis and acute respiratory distress syndrome (ARDS), which were were “the most common conditions leading to intensive care unit admission, ventilator support, or death among those with severe COVID-19 infections”.", "sent_context": "A review of treatments for COVID-19 by Harvard Medical School pointed to earlier studies showing high doses of IV vitamin C may help treat sepsis and acute respiratory distress syndrome (ARDS), which were were “the most common conditions leading to intensive care unit admission, ventilator support, or death among those with severe COVID-19 infections”. But it added “there is no evidence that taking vitamin C will help prevent infection” and high doses of vitamin C could cause nausea, cramps and an increased risk of kidney stones.", "sent_similarity": 0.694, "sent_inference": [0.0072, 0.99, 0.0024]}, "2": {"sent_id": 3, "sent": "It said vitamin C had shown benefits in reducing symptoms and mortality in some conditions (page 2) and “additional studies detailing the use of IV Vit-C for the treatment of severe Covid-19 infected pneumonia are definitely warranted” (page 6).", "sent_context": "A study published in PharmaNutrition in April looked at the potential for using high doses of IV vitamin C for treating ARDS in COVID-19 patients. It said vitamin C had shown benefits in reducing symptoms and mortality in some conditions (page 2) and “additional studies detailing the use of IV Vit-C for the treatment of severe Covid-19 infected pneumonia are definitely warranted” (page 6). A non-peer-reviewed overview of the effectiveness of treating COVID-19 with vitamin C by researchers from the University Hospital of Zurich was published in April.", "sent_similarity": 0.652, "sent_inference": [0.034, 0.96, 0.0071]}}}, "3": {"docid": "5095", "content": "Can vitamin C prevent or treat COVID-19 (coronavirus)? Medical News Today Newsletter Can vitamin C prevent or treat COVID-19? Medically reviewed by Cynthia Taylor Chavoustie, MPAS, PA-C — Written by Zawn Villines on June 8, 2020 Theory Research Alternatives Summary Vitamin C, especially in the form of an intravenous (IV) infusion, is thought to help reverse some of the damage that COVID-19 can cause. There is no proof it can treat or cure coronavirus. Because the novel coronavirus is new, doctors do not fully understand it. All potential treatments remain experimental, and researchers have not yet tested vitamin C or shown that it can treat the virus. There is no evidence to suggest that taking vitamin C is harmful to people with COVID-19 , but there is also no evidence to suggest that it will treat or slow the virus. Researchers are investigating high dose IV injections of vitamin C, not over-the-counter supplements. Learn more in this article. Theory Share on Pinterest Although vitamin C may not treat or prevent COVID-19, it may help reduce the severity of its complications. Vitamin C is an antioxidant , which means that it can fight oxidative damage. When the immune system activates to kill a pathogen, it may also cause oxidative damage . This suggests that vitamin C could fight the damage that the disease-fighting process causes", "url": "https://www.medicalnewstoday.com/articles/can-vitamin-c-prevent-or-treat-covid-19", "source": "medicalnewstoday.com", "domain": "medicalnewstoday.com", "site_name": "medicalnewstoday", "title": "Can vitamin C prevent or treat COVID-19 (coronavirus)?", "content_inference": [0.95, 0.045, 0.0022], "sents": {"0": {"sent_id": 1, "sent": "Medical News Today Newsletter Can vitamin C prevent or treat COVID-19?", "sent_context": "Can vitamin C prevent or treat COVID-19 (coronavirus)? Medical News Today Newsletter Can vitamin C prevent or treat COVID-19? Medically reviewed by Cynthia Taylor Chavoustie, MPAS, PA-C —", "sent_similarity": 0.865, "sent_inference": [0.13, 0.61, 0.26]}, "1": {"sent_id": 0, "sent": "Can vitamin C prevent or treat COVID-19 (coronavirus)?", "sent_context": "Can vitamin C prevent or treat COVID-19 (coronavirus)? Medical News Today Newsletter Can vitamin C prevent or treat COVID-19?", "sent_similarity": 0.827, "sent_inference": [0.19, 0.76, 0.048]}, "2": {"sent_id": 11, "sent": "Although vitamin C may not treat or prevent COVID-19, it may help reduce the severity of its complications.", "sent_context": "Theory Share on Pinterest Although vitamin C may not treat or prevent COVID-19, it may help reduce the severity of its complications. Vitamin C is an antioxidant , which means that it can fight oxidative damage.", "sent_similarity": 0.819, "sent_inference": [0.95, 0.045, 0.0022]}}}, "4": {"docid": "8955", "content": "'A step above injecting bleach': Vitamin C cure for COVID-19 panned  Media ‘A step above injecting bleach’: Vitamin C cure for COVID-19 panned By AAP FactCheck October 28, 2020 2020-10-28 17:23:01 The Statement A Facebook post has been promoting the use of a large intravenous dose of vitamin C to “stop COVID-19”. The post , from September 20, includes an image of a sign on the back of a truck stating: “Stop COVID-19 with vitamin C 20g to 30g intravenous, drip (sic)”. At the time of publication, the post had been shared more than 820 times, attracting more than 3500 reactions and 180 comments. The same image was later shared on the NZ Journal of Natural Medicine Facebook page , among other places. The post was on the Facebook page for Andrew W Saul , whose online bio states he is a New York-based author with a doctorate in “behavioral biology”. He has written a number of books advocating for the use of multivitamins to treat conditions such as alcoholism, depression and “women’s health problems”, and refers to himself as “the megavitamin man”. The caption accompanying the post’s image reads, “The sign is not my own, but I think it is a nice touch", "url": "https://www.aap.com.au/a-step-above-injecting-bleach-vitamin-c-cure-for-covid-19-panned/", "source": "aap.com.au", "domain": "aap.com.au", "site_name": "Australian Associated Press", "title": "'A step above injecting bleach': Vitamin C cure for COVID-19 panned - Australian Associated Press", "content_inference": [0.71, 0.28, 0.0042], "sents": {"0": {"sent_id": 2, "sent": "Vitamin C cure for COVID-19 panned By AAP FactCheck October 28,", "sent_context": "Vitamin C cure for COVID-19 panned  Media ‘A step above injecting bleach’: Vitamin C cure for COVID-19 panned By AAP FactCheck October 28, 2020 2020-10-28 17:23:01", "sent_similarity": 0.896, "sent_inference": [0.71, 0.28, 0.0042]}, "1": {"sent_id": 5, "sent": "A Facebook post has been promoting the use of a large intravenous dose of vitamin C to “stop COVID-19”.", "sent_context": "The Statement A Facebook post has been promoting the use of a large intravenous dose of vitamin C to “stop COVID-19”. The post , from September 20, includes an image of a sign on the back of a truck stating: “Stop COVID-19 with vitamin C 20g to 30g intravenous, drip (sic)”.", "sent_similarity": 0.76, "sent_inference": [0.001, 1.0, 0.0017]}, "2": {"sent_id": 1, "sent": "Vitamin C cure for COVID-19 panned  Media ‘A step above injecting bleach’:", "sent_context": "'A step above injecting bleach': Vitamin C cure for COVID-19 panned  Media ‘A step above injecting bleach’: Vitamin C cure for COVID-19 panned By AAP FactCheck October 28,", "sent_similarity": 0.738, "sent_inference": [0.6, 0.4, 0.0057]}}}, "5": {"docid": "1050", "content": "It is correct that intravenous vitamin C is among the potential treatment approaches for COVID-19 mentioned in the publication, but it is not the only one: the article also emphasizes the importance of the body’s water and electrolyte balance, certain drugs such as antivirals, and interventions such as hemofiltration depending on the patient’s condition. The second article, by the Second Affiliated Hospital of Xi’an Jiaotong University (Xibei Hospital), describes the use of IV high-dose vitamin C to treat COVID-19. However, the OMNS article cherry-picks a specific segment of the article that highlights only the positive effects of the treatment (translated into English from the original Mandarin): “ [H]igh-dose vitamin C achieved good results in clinical applications. We believe that for patients with severe neonatal pneumonia and critically ill patients, vitamin C treatment should be initiated as soon as possible after admission… [E]arly application of large doses of vitamin C can have a strong antioxidant effect, reduce inflammatory responses, and improve endothelial function… Numerous studies have shown that the dose of vitamin C has a lot to do with the effect of treatment… [H]igh-dose vitamin C can not only improve antiviral levels, but more importantly, can prevent and treat acute lung injury (ALI) and acute respiratory distress (ARDS)", "url": "https://healthfeedback.org/claimreview/no-the-shanghai-government-has-not-recommended-intravenous-vitamin-c-as-a-treatment-for-covid-19/", "source": "healthfeedback.org", "domain": "healthfeedback.org", "site_name": "Health Feedback", "title": "No, the Shanghai government has not recommended intravenous vitamin C as a treatment for COVID-19", "content_inference": [0.0078, 0.69, 0.3], "sents": {"0": {"sent_id": 0, "sent": "It is correct that intravenous vitamin C is among the potential treatment approaches for COVID-19 mentioned in the publication, but it is not the only one:", "sent_context": "It is correct that intravenous vitamin C is among the potential treatment approaches for COVID-19 mentioned in the publication, but it is not the only one: the article also emphasizes the importance of the body’s water and electrolyte balance, certain drugs such as antivirals, and interventions such as hemofiltration depending on the patient’s condition.", "sent_similarity": 0.78, "sent_inference": [0.018, 0.97, 0.011]}, "1": {"sent_id": 5, "sent": "“ [H]igh-dose vitamin C achieved good results in clinical applications.", "sent_context": "(translated into English from the original Mandarin): “ [H]igh-dose vitamin C achieved good results in clinical applications. We believe that for patients with severe neonatal pneumonia and critically ill patients, vitamin C treatment should be initiated as soon as possible after admission… [E]arly application of large doses of vitamin C can have a strong antioxidant effect, reduce inflammatory responses, and improve endothelial function… Numerous studies have shown that the dose of vitamin C has a lot to do with the effect of treatment… [H]igh-dose vitamin C can not only improve antiviral levels, but more importantly, can prevent and treat acute lung injury (ALI) and acute respiratory distress (ARDS)", "sent_similarity": 0.629, "sent_inference": [0.0078, 0.69, 0.3]}, "2": {"sent_id": 2, "sent": "The second article, by the Second Affiliated Hospital of Xi’an Jiaotong University (Xibei Hospital), describes the use of IV high-dose vitamin C to treat COVID-19.", "sent_context": "the article also emphasizes the importance of the body’s water and electrolyte balance, certain drugs such as antivirals, and interventions such as hemofiltration depending on the patient’s condition. The second article, by the Second Affiliated Hospital of Xi’an Jiaotong University (Xibei Hospital), describes the use of IV high-dose vitamin C to treat COVID-19. However, the OMNS article cherry-picks a specific segment of the article that highlights only the positive effects of the treatment", "sent_similarity": 0.615, "sent_inference": [0.00093, 1.0, 0.0014]}}}, "6": {"docid": "6514", "content": "But for people that participate in brief periods of severe physical exercise (such as marathon runners and skiers), vitamin C halved the duration and severity of their common cold risk. These slight effects of vitamin C on the coronavirus that causes the common cold have spurred a new clinical trial looking to cure COVID-19 infections using very high intravenous doses of vitamin C. These trials have just started and no results are yet posted . Intravenous application of vitamin C will result in much higher and faster levels of the vitamin in the blood than any amount found in vitamin C supplements taken orally. Though this approach could increase vitamin C’s mild protective effect, this is yet hypothetical and intravenous injection comes with its own risks, such as infection, blood vessel damage, air embolism or blood clots. So alhough vitamin C does have some small effect on the common cold, it’s unlikely that taking large amounts of vitamin C supplements will cure a COVID-19 infection – or have a large effect at all. Even if intravenous vitamin C works to shorten or cure COVID-19, it will likely only be a stop-gap before therapies directed at the virus, such as vaccinations, take over. The most effective way to avoid the virus still remains washing hands, not touching the eyes, nose or mouth, and keeping your distance from anyone exhibiting symptoms", "url": "https://www.snopes.com/news/2020/03/09/coronavirus-its-time-to-debunk-claims-that-vitamin-c-could-cure-it/", "source": "snopes.com", "domain": "snopes.com", "site_name": "Snopes.com", "title": "Coronavirus: It’s Time to Debunk Claims That Vitamin C Could Cure It", "content_inference": [0.6, 0.39, 0.0023], "sents": {"0": {"sent_id": 6, "sent": ", it’s unlikely that taking large amounts of vitamin C supplements will cure a COVID-19 infection – or have a large effect at all.", "sent_context": "So alhough vitamin C does have some small effect on the common cold , it’s unlikely that taking large amounts of vitamin C supplements will cure a COVID-19 infection – or have a large effect at all. Even if intravenous vitamin C works to shorten or cure COVID-19, it will likely only be a stop-gap before therapies directed at the virus, such as vaccinations, take over.", "sent_similarity": 0.788, "sent_inference": [0.6, 0.39, 0.0023]}, "1": {"sent_id": 7, "sent": "Even if intravenous vitamin C works to shorten or cure COVID-19, it will likely only be a stop-gap before therapies directed at the virus, such as vaccinations, take over.", "sent_context": ", it’s unlikely that taking large amounts of vitamin C supplements will cure a COVID-19 infection – or have a large effect at all. Even if intravenous vitamin C works to shorten or cure COVID-19, it will likely only be a stop-gap before therapies directed at the virus, such as vaccinations, take over. The most effective way to avoid the virus still remains washing hands, not touching the eyes, nose or mouth, and keeping your distance from anyone exhibiting symptoms", "sent_similarity": 0.764, "sent_inference": [0.3, 0.69, 0.0032]}, "2": {"sent_id": 1, "sent": "These slight effects of vitamin C on the coronavirus that causes the common cold have spurred a new clinical trial looking to cure COVID-19 infections using very high intravenous doses of vitamin C.", "sent_context": "But for people that participate in brief periods of severe physical exercise (such as marathon runners and skiers), vitamin C halved the duration and severity of their common cold risk. These slight effects of vitamin C on the coronavirus that causes the common cold have spurred a new clinical trial looking to cure COVID-19 infections using very high intravenous doses of vitamin C. These trials have just started and no results are yet posted .", "sent_similarity": 0.755, "sent_inference": [0.0025, 1.0, 0.0008]}}}, "7": {"docid": "7267", "content": "” The video corresponds with images of Woravat on his Facebook page. Professor Prasit told AFP he is not the man speaking in the misleading video. \"The post tried to impersonate me,\" he said during a telephone interview on January 14, 2021. Vitamin C claim There is not enough evidence to prove that vitamin C is an effective treatment for Covid-19, health experts say. A November 3, statement from the National Institutes of Health (NIH), medical research agency, reads: “There are insufficient data for the Covid-19 Treatment Guidelines Panel (the Panel) to recommend either for or against the use of vitamin C for the treatment of Covid-19 in non-critically ill patients.” Dr. Pokrath Hansasuta , an assistant professor of virology at Thailand’s Chulalongkorn University, told AFP by phone on January 14, 2021 that there is “still no academic evidence” to support the that vitamin C can cure Covid-19. In response to the claim, Dr. Kanitha Tananuwong , associate professor at the Department of Food Technology, Chulalongkorn University warned against exceeding the recommended daily intakes of vitamin C. “As per the daily recommendations of the Thai recommended daily intakes, people should not take more than 60 mg a day,\" she told AFP by Line messaging app on January 14, 2021", "url": "https://factcheck.afp.com/false-social-media-posts-purport-share-coronavirus-cure-thai-hospital-dean", "source": "factcheck.afp.com", "domain": "factcheck.afp.com", "site_name": "Fact Check", "title": "False social media posts purport to share coronavirus 'cure' from Thai hospital dean", "content_inference": [0.94, 0.059, 0.0018], "sents": {"0": {"sent_id": 7, "sent": "Thailand’s Chulalongkorn University, told AFP by phone on January 14, 2021 that there is “still no academic evidence” to support the that vitamin C can cure Covid-19.", "sent_context": "Dr. Pokrath Hansasuta , an assistant professor of virology at Thailand’s Chulalongkorn University, told AFP by phone on January 14, 2021 that there is “still no academic evidence” to support the that vitamin C can cure Covid-19. In response to the claim, Dr. Kanitha Tananuwong , associate professor at the Department of Food Technology, Chulalongkorn University warned against exceeding the recommended daily intakes of vitamin C. “", "sent_similarity": 0.75, "sent_inference": [0.94, 0.059, 0.0018]}, "1": {"sent_id": 5, "sent": "the Covid-19 Treatment Guidelines Panel (the Panel) to recommend either for or against the use of vitamin C for the treatment of Covid-19 in non-critically ill patients.”", "sent_context": "A November 3, statement from the National Institutes of Health (NIH), medical research agency, reads: “There are insufficient data for the Covid-19 Treatment Guidelines Panel (the Panel) to recommend either for or against the use of vitamin C for the treatment of Covid-19 in non-critically ill patients.” Dr. Pokrath Hansasuta , an assistant professor of virology at", "sent_similarity": 0.734, "sent_inference": [0.12, 0.74, 0.14]}, "2": {"sent_id": 3, "sent": "Vitamin C claim There is not enough evidence to prove that vitamin C is an effective treatment for Covid-19, health experts say.", "sent_context": "\"The post tried to impersonate me,\" he said during a telephone interview on January 14, 2021. Vitamin C claim There is not enough evidence to prove that vitamin C is an effective treatment for Covid-19, health experts say. A November 3, statement from the National Institutes of Health (NIH), medical research agency, reads: “There are insufficient data for", "sent_similarity": 0.658, "sent_inference": [0.56, 0.44, 0.0061]}}}, "8": {"docid": "5095", "content": "A 2020 meta-analysis of nine existing clinical trials compared a group of people who received an IV infusion with a group of controls. The researchers found that, on average, vitamin C shortened the length of mechanical ventilation by 14% . The effect varied from study to study, though, and it was larger when members of the control group needed longer periods of ventilation. A 2019 meta-analysis found that vitamin C infusions could shorten the length of intensive care unit stays by 7.8% and the need for mechanical ventilation by 18.2%. The study looked at a wide range of medical conditions, but not at COVID-19. A 2019 randomized controlled trial looked at people with sepsis and severe acute respiratory failure , which are two complications that people with severe COVID-19 may experience. Participants received either a placebo or a vitamin C infusion. Although vitamin C did not decrease the rate of organ failure or sepsis, fewer people in the vitamin C group died. A 2018 study compared people with severe pneumonia who received a vitamin C, thiamine , and hydrocortisone infusion with those who did not. The study authors adjusted for possible differences in the group but still found that the vitamin C group had better outcomes. Specifically, they were less likely to die and had better improvements in their lung scans. Alternative treatments and prevention Although doctors have experimented with different treatments for COVID-19 , they have not yet discovered an effective treatment or cure", "url": "https://www.medicalnewstoday.com/articles/can-vitamin-c-prevent-or-treat-covid-19", "source": "medicalnewstoday.com", "domain": "medicalnewstoday.com", "site_name": "medicalnewstoday", "title": "Can vitamin C prevent or treat COVID-19 (coronavirus)?", "content_inference": [0.75, 0.24, 0.012], "sents": {"0": {"sent_id": 12, "sent": "Alternative treatments and prevention Although doctors have experimented with different treatments for COVID-19 , they have not yet discovered an effective treatment or cure", "sent_context": "Specifically, they were less likely to die and had better improvements in their lung scans. Alternative treatments and prevention Although doctors have experimented with different treatments for COVID-19 , they have not yet discovered an effective treatment or cure", "sent_similarity": 0.622, "sent_inference": [0.75, 0.24, 0.012]}, "1": {"sent_id": 3, "sent": "A 2019 meta-analysis found that vitamin C infusions could shorten the length of intensive care unit", "sent_context": "The effect varied from study to study, though, and it was larger when members of the control group needed longer periods of ventilation. A 2019 meta-analysis found that vitamin C infusions could shorten the length of intensive care unit stays by 7.8% and the need for mechanical ventilation by 18.2%.", "sent_similarity": 0.547, "sent_inference": [0.0052, 0.96, 0.04]}, "2": {"sent_id": 8, "sent": "Although vitamin C did not decrease the rate of organ failure or sepsis, fewer people in the vitamin C group died.", "sent_context": "Participants received either a placebo or a vitamin C infusion. Although vitamin C did not decrease the rate of organ failure or sepsis, fewer people in the vitamin C group died. A 2018 study compared people with severe pneumonia who received a vitamin C, thiamine , and hydrocortisone infusion with those who did not.", "sent_similarity": 0.513, "sent_inference": [0.12, 0.88, 0.0017]}}}, "9": {"docid": "5095", "content": "It also aids healthy immune function by supporting the development of white blood cells . In its role as an antioxidant, vitamin C may also help fight inflammation, which can damage the lungs and other organs. Some evidence suggests that people with severe COVID-19 experience dangerous levels of inflammation. However, a 2020 paper cautions that very high doses of vitamin C may change the way immune cells die, increasing the risk of localized inflammation. The authors recommend adding a steroid treatment called a glucocorticoid to reduce this inflammation. Vitamin C levels also tend to decline when a person is unwell, even though the immune system’s need for this vitamin increases. Some doctors believe that taking vitamin C supplements can help prevent this depletion, thereby supporting the immune system. Vitamin C causes few side effects, even at high doses. This means that it may be a safer alternative to riskier treatments. Research and evidence A handful of papers have suggested that vitamin C may help treat inflammation and symptoms associated with COVID-19. At least one clinical trial testing this is underway, but it will not finish until September 2020. For now, the research supporting the use of vitamin C for COVID-19 has looked at conditions such as acute respiratory distress syndrome and the need for mechanical ventilation due to severe cases of COVD-19. It has not looked specifically at people with COVID-19", "url": "https://www.medicalnewstoday.com/articles/can-vitamin-c-prevent-or-treat-covid-19", "source": "medicalnewstoday.com", "domain": "medicalnewstoday.com", "site_name": "medicalnewstoday", "title": "Can vitamin C prevent or treat COVID-19 (coronavirus)?", "content_inference": [0.0047, 0.99, 0.0012], "sents": {"0": {"sent_id": 10, "sent": "A handful of papers have suggested that vitamin C may help treat inflammation and symptoms associated with COVID-19.", "sent_context": "Research and evidence A handful of papers have suggested that vitamin C may help treat inflammation and symptoms associated with COVID-19. At least one clinical trial testing this is underway, but it will not finish until September 2020.", "sent_similarity": 0.814, "sent_inference": [0.00098, 1.0, 0.0026]}, "1": {"sent_id": 12, "sent": "For now, the research supporting the use of vitamin C for COVID-19 has looked at conditions such as acute respiratory distress syndrome and the need for mechanical ventilation due to severe cases of COVD-19.", "sent_context": "At least one clinical trial testing this is underway, but it will not finish until September 2020. For now, the research supporting the use of vitamin C for COVID-19 has looked at conditions such as acute respiratory distress syndrome and the need for mechanical ventilation due to severe cases of COVD-19. It has not looked specifically at people with COVID-19", "sent_similarity": 0.667, "sent_inference": [0.0047, 0.99, 0.0012]}, "2": {"sent_id": 6, "sent": "Some doctors believe that taking vitamin C supplements can help prevent this depletion, thereby supporting the immune system.", "sent_context": "Vitamin C levels also tend to decline when a person is unwell, even though the immune system’s need for this vitamin increases. Some doctors believe that taking vitamin C supplements can help prevent this depletion, thereby supporting the immune system. Vitamin C causes few side effects, even at high doses.", "sent_similarity": 0.64, "sent_inference": [0.0014, 0.99, 0.0045]}}}}, "veracity": {"veracity_output": "False", "veracity_outputs_probs": [0.9999998807907104, 6.861498746957295e-08]}}